tutorials/test.realGas/laminarCounterFlowFlame-2D/GRI30.new/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01325e5;  //1  atm
//internalField   uniform 1.01325e6;  //10 atm
//internalField   uniform 2.02650e6;  //20 atm
//internalField   uniform 2.02650e6;  //20 atm
//internalField   uniform 5.06625e6;  //50 atm
//internalField   uniform 1.01325e7;  //100 atm
//internalField   uniform 1.51988e6;  //150 atm
//internalField   uniform 2.0265e7;   //200 atm
//internalField   uniform 3.03975e7;  //300 atm

boundaryField
{
    fuel
    {
        type            zeroGradient;
    }
    oxidizer
    {
        type            zeroGradient;
    }
    outlet
    {
//        type            zeroGradient;
        type            totalPressure;
        p0              $internalField;
    }

    axis
    {
        type            empty;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
