tutorials/test.realGas/laminarCounterFlowFlame-2D/GRI30.new/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    //mixture         SRKchungKineticMixture;
    mixture         SRKchungTakaMixture;
    //mixture         PRchungTakaMixture;
    //mixture         PRchungKineticMixture;
    //transport       chungKinetic;
    transport       chungTaka;
    thermo          rfJanaf;
    energy          sensibleEnthalpy;
    equationOfState soaveRedlichKwong;
    //equationOfState PengRobinson;
    specie          rfSpecie;
}

//ideal gas
/*
thermoType
{
    type            hePsiThermo;
    mixture         idKineticReactingMixture;
    transport       sutherlandKinetic;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}
*/


inertSpecie CO2;
//inertSpecie N2;

//#include "thermo.inputData"
#include "thermo.inputData_GRI"

// ************************************************************************* //
